import { Component, OnInit } from '@angular/core';
import { ServicesService } from "../../services/services.service";
import { dataServices } from "../../shared/data-services";

@Component({
  selector: 'app-our-services',
  templateUrl: './our-services.component.html',
  styleUrls: ['./our-services.component.css']
})
export class OurServicesComponent implements OnInit {
  dataServices = [
    {
      id: '1',
      urlToImage: '',
      title: 'Бухгалтерські послуги',
      description: 'Підготовка та здача усіх видів звітності, складання фінансової звітності по корпоративним правилам чи національним стандартам. Розрахунок зарплати та кадровий облік. Організація бухгалтерського обліку. Ведення первинної документації. Робота з контролюючими органами. Оптимізація розходів та оподаткування. Розрахунок податків. Контроль здійснення взаєморозрахунків, сплати податків. Набір платіжних доручень в систему клієнт-банк. Звірка з контрагентами. Інвентаризація. Отримання довідок. Трансформація бухгалтерської звітності у фінансову. Ведення підприємницького обліку.'
    },
    {
      id: '2',
      urlToImage: '',
      title: 'Адвокатські послуги',
      description: 'Допомога у вирішенні господарських спорів - стягнення коштів з боржників написання претензій та відзивів представництво інтересів в суді. Допомога у вирішенні кредитних спорів - визнання кредитного договору недійсним, скасування пені та штрафів, скасування незаконного підняття кредитної ставки, визнання договору іпотеки недійсним. Допомога у вирішенні земельних спорів - земельні спори між сусідами, незаконна відмова у наданні, емельної ділянки, незаконна відмова у видачі паїв, незаконне скасування рішень міських/сільських, рад про виділення земельних ділянок, незаконне відчуження земельних ділянок та паїв. Допомога у вирішенні сімейних спорів - розірвання шлюбу, поділ майна подружжя, стягнення аліментів, зменшення розміру аліментів, встановлення батьківства, встановлення родинних зв’язків, усиновлення. Допомога у вирішенні спадкових спорів - спори між спадкоємцями, визнання права власності на спадщину, поновлення пропущеного строку для прийняття, спадщини.'
    },
    {
      id: '3',
      urlToImage: '',
      title: 'Аутсорсинг бухгалтерського обліку юридичних осіб та ФОП',
      description: 'Підготовка та здача усіх видів звітності. Складання фінансової звітності по корпоративним правилам чи національним стандартам. Розрахунок зарплати та кадровий облік. Організація бухгалтерського обліку. Ведення первинної документації. Робота з контролюючими органами. Оптимізація розходів та оподаткування. Розрахунок податків. Контроль здійснення взаєморозрахунків, сплати податків. Набір платіжних доручень в систему клієнт-банк. Звірка з контрагентами. Інвентаризація. Отримання довідок. Трансформація бухгалтерської звітності у фінансову. Ведення підприємницького обліку.'
    },
    {
      id: '4',
      urlToImage: '',
      title: 'Юридичні послуги',
      description: 'Організація та повний юридичний супровід діяльності компанії. Підготовка та правова експертиза договорів (оренда, купівля-продаж, надання послуг/виконання робіт, операції з нерухомістю та землею, інші). Представництво у судах, податкових та інших державних органах і установах. В тому числі підготовка та погодження відповідей на запити органів ДФС та інших державних органів, повернення на рахунки компанії переплати із податкових зобов\'язань тощо. Ведення претензійно - позовної роботи: складання претензій, позовних заяв, апеляційних, касаційних скарг, заперечень, доповнень та інших документів необхідних для захисту інтересів компанії. Розробка тендерної документації та проектів договорів, рамкових угод для проведення закупівель в рамках проектної документації. Прийняття участі в оцінці тендерних пропозицій учасників при проведенні процедур закупівель. Корпоративна діяльність: підготовка документів з питань реєстрації, ліквідації, внесення змін до установчих документів підприємства та здійснення необхідних реєстраційних дій, розробка та погодження протоколів загальних зборів, розробка та впровадження внутрішніх документів а (наказів, розпоряджень, довіреностей тощо). Підготовка документів для отримання дозволу на працевлаштування іноземців, та отримання дозволу, підготовка документів для отримання дозволу на тимчасове перебування іноземців на території України.'
    },
    {
      id: '5',
      urlToImage: '',
      title: 'Послуги IT',
      description: 'Технічна підтримка робочих місць, усунення інцидентів в роботі операційної системи, забезпечення роботи пакетів офісних програм. Аудит і консультування, тестування та перевірка мережі і систем на вразливість та працездатність, консультації та вирішення складних завдань. Віддалений сервер 1С, встановлення і налаштування сервера під ключ під потреби бухгалтерського обліку, підтримка офісних і банківських програм. Підтримка серверів, налагодження та супровід серверного програмного забезпечення операційних систем.  Управління сайтами, перенесення, продовження, розміщення на хостингу, реєстрація та управління доменами, розміщення контенту. Безпека і резервне копіювання даних, забезпечення регулярного запису, змін систем і баз даних в окреме сховище файлів. Локальні мережі (побудова і обслуговування), підбір, закупівля, настройка серверного обладнання, периферії. Установка і настройка обладнання для доступу до мережі Інтернет. Діагностика та усунення інцидентів. Власна IP телефонія, налаштування зовнішньої та внутрішньої корпоративної IP телефонії.'
    }
  ];
  // dataServices;
  // urlToImage = '';
  // title = '';
  // description = '';

  constructor(private servicesService: ServicesService) {}

  ngOnInit(): void {
  }

}
